/*******************************************************************
Copyright(c) 2018, James Fan
All rights reserved.
*******************************************************************/

// 华为机试在线训练
// 第3题：明明的随机数
// 题目：明明有N个[1,1000](N<=100)的随机数，请你完成“去重”和“排序”工作。
// 输入：输入多行，先输入随机数的个数，在分别输入随机数。
// 输出：返回多行，处理后的结果。

// 网友 SINGLE、DOG 的答案，很赞！

#include <iostream>

using namespace std;

int main() 
{
    int N, n;
    while (cin >> N) {
        int a[1001] = { 0 };
        while (N--) {
            cin >> n;
            a[n] = 1;
        }
        for (int i = 0; i < 1001; i++)
            if (a[i])
                cout << i << endl;
    }
    return 0;
}