/*******************************************************************
Copyright(c) 2018, James Fan
All rights reserved.
*******************************************************************/

// 华为机试在线训练
// 第x题：百钱买百鸡
// 题目：公元前五世纪，我国古代数学家张丘建在《算经》一书中提出了“百鸡问题”：
// 鸡翁一值钱五，鸡母一值钱三，鸡雏三值钱一。百钱买百鸡，问鸡翁、鸡母、鸡雏各几何？
// 输入：任意整数，即可运行程序。
// 输出：鸡翁、鸡母、鸡雏组合的列表

#include <iostream>

using namespace std;

int main(int argc, char const *argv[])
{
	int n;
	while (cin >> n)
	{
		// 设买鸡翁、鸡母、鸡雏各x、y、z只
		for (int x = 0; x <= 100/5; ++x)
		{
			for (int y = 0; y <= (100-5*x)/3; ++y)
			{
				int z = 100 - x - y;
				// 余钱可买鸡雏数
				if (z == 3*(100 - 5*x - 3*y))
					cout << x << " " << y << " " << z << endl;
			}
		}
	}
	return 0;
}